cfg/Catalogs/ВидыОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВидыОтпусков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтпускНеПереноситсяНаСледующийГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтпускаДляФормОтчетности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпускНеКомпенсируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедетсяУчетОстатков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСотрудника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоКалендарнымГодам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьПраздники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВРезервОтпусков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Enums/СостоянияРаботникаОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СостоянияРаботникаОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРаботает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заболевание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускЕжегодный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускУчебный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускБезСохраненияЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствуетПоНевыясненнойПричине</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускУчебныйНеоплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВынужденныйПрогул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосударственныеОбязанности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прогулы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВыходныеДниОплачиваемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Простой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мобилизован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Catalogs/ВидыОтпусков/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Процедура ПриОткрытии()
	
	Если ЭтоНовый() Тогда
		ВидОтпускаДляФормОтчетности = "додаткова";
		СостояниеСотрудника = Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодный;
		ОтпускНеПереноситсяНаСледующийГод = Истина;
	    ОтпускНеКомпенсируется = Истина;
		УчетПоКалендарнымГодам = Истина;
		ВключатьПраздники = Истина;
		НеВключатьВРезервОтпусков = Истина;
	КонецЕсли;	
	
	ЭлементыФормы.УчетПоКалендарнымГодам.Доступность = ВедетсяУчетОстатков;
	ЭлементыФормы.ОтпускНеПереноситсяНаСледующийГод.Доступность = ВедетсяУчетОстатков;
	ЭлементыФормы.КомпенсироватьПриУвольнении.Доступность = ВедетсяУчетОстатков;
	ЭлементыФормы.НеВключатьВРезервОтпусков.Доступность = ВедетсяУчетОстатков;
	
	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю,ЭлементыФормы.Код);

КонецПроцедуры

Процедура ПослеЗаписи()
	
	МеханизмНумерацииОбъектов.ОбновитьПодсказкуКодНомерОбъекта(ЭтотОбъект.Метаданные(), ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);

КонецПроцедуры // ПослеЗаписи()

Процедура ДействияФормыРедактироватьКод(Кнопка)
	
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(ЭтотОбъект.Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
	
КонецПроцедуры // ДействияФормыРедактироватьКод()

Процедура ВидОтпускаДляФормОтчетностиНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СписокВыбора = Новый СписокЗначений;

	СписокВыбора.Добавить("щорічна основна");
    СписокВыбора.Добавить("додаткова");
	СписокВыбора.Добавить("навчальна");
	СписокВыбора.Добавить("без збереження заробітної плати");
	
	ЭлементыФормы.ВидОтпускаДляФормОтчетности.СписокВыбора = СписокВыбора;
	
КонецПроцедуры

Процедура ВедетсяУчетОстатковПриИзменении(Элемент)
	
	Если НЕ ВедетсяУчетОстатков Тогда
		ОтпускНеПереноситсяНаСледующийГод = Истина;
	    ОтпускНеКомпенсируется = Истина;
		УчетПоКалендарнымГодам = Истина;
		ВключатьПраздники = Истина;
		НеВключатьВРезервОтпусков = Истина;
	Конецесли;
	
	ЭлементыФормы.УчетПоКалендарнымГодам.Доступность = ВедетсяУчетОстатков;
	ЭлементыФормы.ОтпускНеПереноситсяНаСледующийГод.Доступность = ВедетсяУчетОстатков;
	ЭлементыФормы.КомпенсироватьПриУвольнении.Доступность = ВедетсяУчетОстатков;
	ЭлементыФормы.НеВключатьВРезервОтпусков.Доступность = ВедетсяУчетОстатков;
	
КонецПроцедуры

Процедура СостояниеСотрудникаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ЭлементыФормы.СостояниеСотрудника.СписокВыбора = ПолучитьСписокОтпусковОрганизации();	
	
КонецПроцедуры

Процедура СостояниеСотрудникаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Элемент.Значение = ВыбранноеЗначение;
	
КонецПроцедуры

Процедура ВидОтпускаДляФормОтчетностиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Элемент.Значение = ВыбранноеЗначение;
	
КонецПроцедуры
